Q1. List Comprehension<br>
1부터 1000까지의 정수 중에 3의 배수만 있는 리스트를 한 줄로 만드시오.

In [2]:
thirds = []

In [ ]:
print(thirds)

Q2. List Comprehension<br>
num_children이 2인 사람들의 name과 age가 들어있는 리스트를 만드시오.

In [5]:
import pandas as pd

In [8]:
data = pd.DataFrame({'name': ['john','mary','peter','jeff','bill','lisa'],
                     'age': [23, 78, 22, 19, 45, 33],
                     'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'],
                     'num_children' : [2, 2, 0, 1, 2, 1],
                     'num_pets' : [0, 4, 0, 5, 0, 0]})

In [10]:
data

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [18]:
two_children = ___________

In [20]:
name_age = zip(__________,
               __________)
name_age_list = list(name_age)

In [21]:
print(name_age_list)

[('john', 23), ('mary', 78), ('bill', 45)]